#+title: 面试技能收集

本页旨在记录准备面试过程中学习的知识。
** sizeof
   =sizeof= will calculate in-memory size of an object. So when
   applying it to STL objects, it will results in the sizeof STL
   container itself instead of the size of all its elements. Example
   (on 64bit machine):
   #+begin_src cpp :results output
     #include <iostream>
     #include <string>
     #include <vector>

     using namespace std;

     int main(int argc, char *argv[])
     {
         string str = "abcdefgaaaaaaaaaaaa";
         cout << "sizeof(str) = " << sizeof(str) << endl;
         vector<int> vec(100);
         cout << "sizeof(vec(100)) = " << sizeof(vec) << endl;
         vector<char> cvec(100);
         cout << "sizeof(cvec(100)) = " << sizeof(cvec) << endl;
         
         return 0;
     }
   #+end_src

   #+RESULTS:
   : sizeof(str) = 8
   : sizeof(vec(100)) = 24
   : sizeof(cvec(100)) = 24

** 装饰器 Decorator
   python 中的decorator本质上就是包装函数 =wrap= ，以被包装函数 =fn=
   为参数，返回一个包装后的函数并赋给 =fn= 。
   
   例[fn:1]：
   #+begin_src python :results output
     def hello(fn):
         def wrapper():
             print "hello, %s" % fn.__name__
             fn()
             print "goodby, %s" % fn.__name__
         return wrapper
     @hello
     def foo():
         print "i am foo"
      
     foo()
   #+end_src

   #+RESULTS:
   : hello, foo
   : i am foo
   : goodby, foo
   
   这里 =@hello= 的语法想当于执行了 =func = decorator(func)= ，即
   =decorator= 以函数 =func= 为参数，返回包装后的参数。注意到这里最后
   的赋值，所以它相当于lisp里的 =(set! func (decorator func))= [fn:2]，
   而相比于使用 =set!= 的 =lisp= 实现，python的优势在于简化了语法。

   函数 =decorator= 本身也可以接收参数：

   #+begin_src python
     @decorator(arg1, arg2)
     def func():
         pass
   #+end_src
   相当于:
   #+begin_src python
     func = decorator(arg1, arg2)(func)
   #+end_src
